Revit 2024 API
SpecTypeId.ElectricalPower Property
 Power, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId ElectricalPower { get; }
Visual Basic
Public Shared ReadOnly Property ElectricalPower As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElectricalPower {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace